features/product/repository/ProductRepository.php

    public function getListAllProducts(): array
    {
        return  Categories::find()->joinWith('products')->asArray()->all();
---
SELECT `categories`.* FROM `categories` LEFT JOIN `product` ON `categories`.`id` = `product`.`category_id`