features/stocks/repository/StockRepository.php

SELECT * FROM `stocks`
---
    public function getListAllStocks(): array
    {
       return Stocks::find()->all();