features/popular/repository/PopularRepository.php

SELECT * FROM `popular`
---
    public function getListAllPopular(): array
    {
        return Popular::find()->asArray()->all();

SELECT * FROM `popular` WHERE `id`='2'
---
    public function uploadImageId(string $image, string $id) : bool
    {
        $popular = Popular::findOne($id);

SELECT * FROM `popular` WHERE `id`='2'
---
    public function itemUpdate($id,string $title, string $description,string $price) : bool
    {
        $popular = Popular::findOne($id);