models/User.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `users` WHERE `id`=1

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['accessToken' => $token]);
---
SELECT * FROM `users` WHERE `accessToken`='admin'